# Задача 1. Реализовать функцию
# Способ 4 — Записать формулу как одно выражение, обращаться к функциям по имени.

from math import *


def main(x, z, y):
    return (
            ((54*x + y**2 + z**3 / 25) ** 5 / 10 - z**4) /
            (93*z - (y + x**2 + 1) ** 4) -
            (exp(11*y**2 + 1 + x**3) ** 3 / 83 - exp(36*z + 1) ** 4) /
            (y**15 / 30 - 21*log(18*x - 25*z**3) ** 2)
    )

# Проверка
if __name__ == '__main__':
    print(main(0.4, -.44, .76))
    print(main(0.91, -.94, .03))
    print(main(0.7, -.64, -.7))
    print(main(0.34, -.03, -.26))
    print(main(0.08, -.53, -.49))
