# Задача 8. Декодирование битового поля
# Способ 1

def main(s: str):
    x = int(s, 16)

    mask_v2 = 0b00000000000000000000000111111100
    mask_v3 = 0b00000000000000000000111000000000
    mask_v4 = 0b00000000000011111111000000000000
    mask_v5 = 0b00001111111100000000000000000000
    mask_v6 = 0b01110000000000000000000000000000

    v2 = (x & mask_v2) >> 2
    v3 = (x & mask_v3) >> 9
    v4 = (x & mask_v4) >> 12
    v5 = (x & mask_v5) >> 20
    v6 = (x & mask_v6) >> 28

    return (v2, v3, v4, v5, v6)

print(
    main('0x563a931b'),
    main('0x42c9e949'),
    main('0x5ba87a22'),
    main('0x70070'),
    sep='\n'
)
